app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("tittle", "author", "category", "image_url", "is_borrowed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)